blog/33.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-02 Tue 16:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.1.4 Running the Evaluator as a Program</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.1.4 Running the Evaluator as a Program
<br />
<span class="subtitle">2024-07-02 Tue</span>
</h1>
<p>
The evaluator provides a description of the process to evaluate a Lisp
expression.  Such a description is in a programming language (Lisp),
so we can run it.  Given that the evaluator ``reduces expressions
ultimately to the application of primitive procedures'', we need a way
to use the underlying Lisp system to apply those procedures.  The
global environment, consequently, shall contain bindings for each
primitive procedure name.  The global environment shall also contain
bindings for <code>true</code> and <code>false</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">setup-environment</span>)
  (<span style="color: #531ab6;">let</span> ((initial-env
         (extend-environment (primitive-procedure-names)
                             (primitive-procedure-objects)
                             the-empty-environment)))
    (define-variable! 'true true initial-env)
    (define-variable! 'false false initial-env)
    initial-env))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-global-environment</span> (setup-environment))
</pre>
</div>

<p>
Primitive procedure are represented as tagged lists. This specific
representation is hidden behind the <code>primitive-procedure?</code> and
<code>primitive-implementation</code> abstractions so it could be replaced by a
different one.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure?</span> proc)
  (tagged-list? proc 'primitive))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-implementation</span> proc) (cadr proc))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">primitive-procedures</span>
  (list (list 'car car)
        (list 'cdr cdr)
        (list 'cons cons)
        (list 'null? null?)
        &lt;MORE PRIMITIVES&gt;
        ))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-names</span>)
  (<span style="color: #531ab6;">map</span> car
       primitive-procedures))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-objects</span>)
  (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (proc) (list 'primitive (cadr proc)))
       primitive-procedures))
</pre>
</div>

<p>
Here is how we apply a primitive
procedure. <code>Apply-in-underlying-scheme</code> is nothing more than the
<code>apply</code> procedures from the underlying scheme we have used in the
previous chapters.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-primitive-procedure</span> proc args)
  (apply-in-underlying-scheme
   (primitive-implementation proc) args))
</pre>
</div>

<p>
Authors provide what they call a ``driver loop'' as a convenience for
running the evaluator, which ``models the read-eval-print loop of the
underlying Lisp system.''
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">input-prompt</span> <span style="color: #3548cf;">";;; M-Eval input:"</span>)
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">output-prompt</span> <span style="color: #3548cf;">";;; M-Eval value:"</span>)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">driver-loop</span>)
  (prompt-for-input input-prompt)
  (<span style="color: #531ab6;">let</span> ((input (read)))
    (<span style="color: #531ab6;">let</span> ((output (eval input the-global-environment)))
      (announce-output output-prompt)
      (user-print output)))
  (driver-loop))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">prompt-for-input</span> string)
  (newline) (newline) (display string) (newline))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">announce-output</span> string)
  (newline) (display string) (newline))
</pre>
</div>

<p>
<code>User-print</code> is used to avoid printing the the environment part of a
compound procedure:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">user-print</span> object)
  (<span style="color: #531ab6;">if</span> (compound-procedure? object)
      (display (list 'compound-procedure
                     (procedure-parameters object)
                     (procedure-body object)
                     '<span style="color: #005f5f;">&lt;procedure-env&gt;</span>))
      (display object)))
</pre>
</div>

<p>
Finally:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-global-environment</span> (setup-environment))

(driver-loop)

<span style="color: #595959;">;;; </span><span style="color: #595959;">M-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">append</span> x y)
  (<span style="color: #531ab6;">if</span> (null? x)
      y
      (cons (car x)
            (append (cdr x) y))))
<span style="color: #595959;">;;; </span><span style="color: #595959;">M-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">M-Eval input:</span>
(append '(a b c) '(d e f))
<span style="color: #595959;">;;; </span><span style="color: #595959;">M-Eval value:</span>
(a b c d e f)
</pre>
</div>

<p>
What follows is the whole code for the evaluator presented so
far. I've evaluated it in DrRacket and I can confirm that it works.
</p>

<p>
Notice: I've renamed <code>apply</code> into <code>apply-evaluator</code>. Racket would
otherwise complain about the first definition (<code>(define
apply-in-underlying-scheme apply)</code>), telling me that I cannot use
<code>apply</code> before defining it.
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">apply-in-underlying-scheme</span> apply)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">cond</span> ((self-evaluating? exp) exp)
        ((variable? exp) (lookup-variable-value exp env))
        ((quoted? exp) (text-of-quotation exp))
        ((assignment? exp) (eval-assignment exp env))
        ((definition? exp) (eval-definition exp env))
        ((if? exp) (eval-if exp env))
        ((lambda? exp)
         (make-procedure (lambda-parameters exp)
                         (lambda-body exp)
                         env))
        ((begin? exp)
         (eval-sequence (begin-actions exp) env))
        ((cond? exp) (eval (cond-&gt;if exp) env))
        ((application? exp)
         (apply-evaluator (eval (operator exp) env)
                          (list-of-values (operands exp) env)))
        (<span style="color: #531ab6;">else</span>
         (error <span style="color: #3548cf;">"Unknown expression type -- EVAL"</span> exp))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-evaluator</span> procedure arguments)
  (<span style="color: #531ab6;">cond</span> ((primitive-procedure? procedure)
         (apply-primitive-procedure procedure arguments))
        ((compound-procedure? procedure)
         (eval-sequence
          (procedure-body procedure)
          (extend-environment
           (procedure-parameters procedure)
           arguments
           (procedure-environment procedure))))
        (<span style="color: #531ab6;">else</span>
         (error
          <span style="color: #3548cf;">"Unknown procedure type -- APPLY"</span> procedure))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-values</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (cons (eval (first-operand exps) env)
            (list-of-values (rest-operands exps) env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-if</span> exp env)
  (<span style="color: #531ab6;">if</span> (true? (eval (if-predicate exp) env))
      (eval (if-consequent exp) env)
      (eval (if-alternative exp) env)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-sequence</span> exps env)
  (<span style="color: #531ab6;">cond</span> ((last-exp? exps) (eval (first-exp exps) env))
        (<span style="color: #531ab6;">else</span> (eval (first-exp exps) env)
              (eval-sequence (rest-exps exps) env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-assignment</span> exp env)
  (set-variable-value! (assignment-variable exp)
                       (eval (assignment-value exp) env)
                       env)
  'ok)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-definition</span> exp env)
  (define-variable! (definition-variable exp)
    (eval (definition-value exp) env)
    env)
  'ok)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">self-evaluating?</span> exp)
  (<span style="color: #531ab6;">cond</span> ((number? exp) true)
        ((string? exp) true)
        (<span style="color: #531ab6;">else</span> false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">variable?</span> exp) (symbol? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">quoted?</span> exp)
  (tagged-list? exp 'quote))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">text-of-quotation</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment?</span> exp)
  (tagged-list? exp 'set!))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-variable</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-value</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition?</span> exp)
  (tagged-list? exp 'define))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-variable</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (cadr exp)
      (caadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-value</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (caddr exp)
      (make-lambda (cdadr exp)   <span style="color: #595959;">; </span><span style="color: #595959;">formal parameters</span>
                   (cddr exp)))) <span style="color: #595959;">; </span><span style="color: #595959;">body</span>

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda?</span> exp) (tagged-list? exp 'lambda))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-parameters</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-body</span> exp) (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-lambda</span> parameters body)
  (cons 'lambda (cons parameters body)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if?</span> exp) (tagged-list? exp 'if))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-predicate</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-consequent</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-alternative</span> exp)
  (<span style="color: #531ab6;">if</span> (not (null? (cdddr exp)))
      (cadddr exp)
      'false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-if</span> predicate consequent alternative)
  (list 'if predicate consequent alternative))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin?</span> exp) (tagged-list? exp 'begin))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin-actions</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">last-exp?</span> seq) (null? (cdr seq)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-exp</span> seq) (car seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-exps</span> seq) (cdr seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sequence-&gt;exp</span> seq)
  (<span style="color: #531ab6;">cond</span> ((null? seq) seq)
        ((last-exp? seq) (first-exp seq))
        (<span style="color: #531ab6;">else</span> (make-begin seq))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-begin</span> seq) (cons 'begin seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">application?</span> exp) (pair? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operator</span> exp) (car exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operands</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">no-operands?</span> ops) (null? ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-operand</span> ops) (car ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-operands</span> ops) (cdr ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond?</span> exp) (tagged-list? exp 'cond))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-clauses</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-else-clause?</span> clause)
  (eq? (cond-predicate clause) 'else))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-predicate</span> clause) (car clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-actions</span> clause) (cdr clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-&gt;if</span> exp)
  (expand-clauses (cond-clauses exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expand-clauses</span> clauses)
  (<span style="color: #531ab6;">if</span> (null? clauses)
      'false                          <span style="color: #595959;">; </span><span style="color: #595959;">no `else' clause</span>
      (<span style="color: #531ab6;">let</span> ((first (car clauses))
            (rest (cdr clauses)))
        (<span style="color: #531ab6;">if</span> (cond-else-clause? first)
            (<span style="color: #531ab6;">if</span> (null? rest)
                (sequence-&gt;exp (cond-actions first))
                (error <span style="color: #3548cf;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                       clauses))
            (make-if (cond-predicate first)
                     (sequence-&gt;exp (cond-actions first))
                     (expand-clauses rest))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">true?</span> x)
  (not (eq? x false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">false?</span> x)
  (eq? x false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-procedure</span> parameters body env)
  (list 'procedure parameters body env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">compound-procedure?</span> p)
  (tagged-list? p 'procedure))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-parameters</span> p) (cadr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-body</span> p) (caddr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-environment</span> p) (cadddr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">enclosing-environment</span> env) (cdr env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-frame</span> env) (car env))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-empty-environment</span> '())

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-frame</span> variables values)
  (cons variables values))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-variables</span> frame) (car frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-values</span> frame) (cdr frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-binding-to-frame!</span> var val frame)
  (set-car! frame (cons var (car frame)))
  (set-cdr! frame (cons val (cdr frame))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extend-environment</span> vars vals base-env)
  (<span style="color: #531ab6;">if</span> (= (length vars) (length vals))
      (cons (make-frame vars vals) base-env)
      (<span style="color: #531ab6;">if</span> (&lt; (length vars) (length vals))
          (error <span style="color: #3548cf;">"Too many arguments supplied"</span> vars vals)
          (error <span style="color: #3548cf;">"Too few arguments supplied"</span> vars vals))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (car vals))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-variable-value!</span> var val env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable -- SET!"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">define-variable!</span> var val env)
  (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (add-binding-to-frame! var val frame))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (scan (frame-variables frame)
          (frame-values frame))))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">primitive-procedures</span>
  (list (list 'car car)
        (list 'cdr cdr)
        (list 'cons cons)
        (list 'null? null?)
        (list '+ +)
        (list '- -)
        (list '* *)
        (list '/ /)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-names</span>)
  (<span style="color: #531ab6;">map</span> car
       primitive-procedures))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure-objects</span>)
  (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (proc) (list 'primitive (cadr proc)))
       primitive-procedures))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">setup-environment</span>)
  (<span style="color: #531ab6;">let</span> ((initial-env
         (extend-environment (primitive-procedure-names)
                             (primitive-procedure-objects)
                             the-empty-environment)))
    (define-variable! 'true true initial-env)
    (define-variable! 'false false initial-env)
    initial-env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-procedure?</span> proc)
  (tagged-list? proc 'primitive))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">primitive-implementation</span> proc) (cadr proc))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-primitive-procedure</span> proc args)
  (apply-in-underlying-scheme
   (primitive-implementation proc) args))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">input-prompt</span> <span style="color: #3548cf;">";;; M-Eval input:"</span>)
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">output-prompt</span> <span style="color: #3548cf;">";;; M-Eval value:"</span>)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">driver-loop</span>)
  (prompt-for-input input-prompt)
  (<span style="color: #531ab6;">let</span> ((input (read)))
    (<span style="color: #531ab6;">let</span> ((output (eval input the-global-environment)))
      (announce-output output-prompt)
      (user-print output)))
  (driver-loop))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">prompt-for-input</span> string)
  (newline) (newline) (display string) (newline))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">announce-output</span> string)
  (newline) (display string) (newline))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">user-print</span> object)
  (<span style="color: #531ab6;">if</span> (compound-procedure? object)
      (display (list 'compound-procedure
                     (procedure-parameters object)
                     (procedure-body object)
                     '<span style="color: #005f5f;">&lt;procedure-env&gt;</span>))
      (display object)))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-global-environment</span> (setup-environment))

(driver-loop)
</pre>
</div>
