blog/33.org
** Exercise 4.14
*Exercise*:
#+begin_quote
Eva Lu Ator and Louis Reasoner are each experimenting with the
metacircular evaluator.  Eva types in the definition of ~map~, and
runs some test programs that use it.  They work fine.  Louis, in
contrast, has installed the system version of ~map~ as a primitive for
the metacircular evaluator.  When he tries it, things go terribly
wrong.  Explain why Louis's ~map~ fails even though Eva's works.
#+end_quote

*Answer*:

~Apply~ is called in both scenarios. The ~arguments~ that ~apply~
receives are the already-evaluated operands of the combination
(evaluated by ~list-of-values~). I think that the problem with using
the primitive ~map~ is that one the arguments received by ~apply~ is
an entity representing a procedure /using our implementation/ (our
implementation is a list whose ~car~ is the tag ~'procedure~, among
other aspects). But the primitive ~car~ expects a different kind of
procedure object (whatever Scheme natively uses).
