blog/33.html
<div id="outline-container-orgf50666f" class="outline-2">
<h2 id="orgf50666f">Exercise 4.14</h2>
<div class="outline-text-2" id="text-orgf50666f">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Eva Lu Ator and Louis Reasoner are each experimenting with the
metacircular evaluator.  Eva types in the definition of <code>map</code>, and
runs some test programs that use it.  They work fine.  Louis, in
contrast, has installed the system version of <code>map</code> as a primitive for
the metacircular evaluator.  When he tries it, things go terribly
wrong.  Explain why Louis's <code>map</code> fails even though Eva's works.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
<code>Apply</code> is called in both scenarios. The <code>arguments</code> that <code>apply</code>
receives are the already-evaluated operands of the combination
(evaluated by <code>list-of-values</code>). I think that the problem with using
the primitive <code>map</code> is that one the arguments received by <code>apply</code> is
an entity representing a procedure <i>using our implementation</i> (our
implementation is a list whose <code>car</code> is the tag <code>'procedure</code>, among
other aspects). But the primitive <code>car</code> expects a different kind of
procedure object (whatever Scheme natively uses).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.5)</span></p>
</div>
</body>
</html>
